/*
* «адание є2. –еализуетс€ с перегрузкой операций; во всех указанных ниже задани€х должны быть реализованы: 
* безаргументный  и инициализирующий конструктор, конструктор копировани€, ввод-вывод, преобразование в строку. 
*
* ¬ариант 14. —оздать класс string дл€ работы со строками, аналогичными строкам Turbo Pascal
* (строка представл€етс€ как массив 255 байтов, длина Ц в первом байте). ћаксимальный размер строки
* должен задаватьс€. ќб€зательно должны быть реализованы: длина строки, поиск подстроки в строке,
* удаление подстроки из строки, вставка подстроки в строку, сцепление двух строк.
*/

#include <iostream>
#include <cstring>
#include <windows.h>

using namespace std;